# Imports

In [8]:
# Importing Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [9]:
path = r"C:\Users\malac\Documents\Instacart Basket Analysis CF"

In [10]:
path

'C:\\Users\\malac\\Documents\\Instacart Basket Analysis CF'

In [11]:
cust_2 = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)
#departments_wrangled import

In [12]:
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged.pkl'))
#ords_prior and df_prods merge import

In [25]:
ords_prods_merge_2 = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_2.pkl'))
#ords_prior and df_prods merge import

In [26]:
ords_prods_merge_2.shape

(32404859, 37)

## Part 1 Wrangle Data

## 4.

In [53]:
cust_2.head()

   user_id first_name Last Name       state  Age date_joined  income
0    26711    Deborah  Esquivel    Missouri   48    1/1/2017  165665
1    33890   Patricia      Hart  New Mexico   36    1/1/2017   59285
2    65803    Kenneth    Farley       Idaho   35    1/1/2017   99568
3   125935   Michelle     Hicks        Iowa   40    1/1/2017   42049
4   130797        Ann   Gilmore    Maryland   26    1/1/2017   40374

In [7]:
#Changing First Name to first_name

cust_2.rename(columns = {'First Name': 'first_name'}, inplace = True)

In [8]:
#Rename Surnam to last_name

cust_2.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [9]:
#Changing Gender to gender

cust_2.rename(columns = {'Gender': 'gender'}, inplace = True)

In [10]:
#Changing STATE to state

cust_2.rename(columns = {'STATE': 'state'}, inplace = True)

In [11]:
#Changing Age to age

cust_2.rename(columns = {'Age': 'age'}, inplace = True)

In [12]:
#Changing n_dependants to number_of_dependants

cust_2.rename(columns = {'n_dependants': 'number_of_dependants'}, inplace = True)

In [13]:
cust_2.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## 5.

In [67]:
#Check for dups

df_dups = cust_2[cust_2.duplicated()]

In [68]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_of_dependants, fam_status, income]
Index: []

## No duplicates

In [69]:
#Check for missing values

cust_2.isnull().sum()

user_id                     0
first_name              11259
last_name                   0
gender                      0
state                       0
age                         0
date_joined                 0
number_of_dependants        0
fam_status                  0
income                      0
dtype: int64

In [71]:
#View missing values

df_nan = cust_2[cust_2['first_name'].isnull() == True]

In [18]:
df_nan

        user_id First Name Last Name         STATE  Age date_joined  income
53        76659        NaN   Gilbert      Colorado   26    1/1/2017   41709
73        13738        NaN     Frost     Louisiana   39    1/1/2017   82518
82        89996        NaN    Dawson        Oregon   52    1/1/2017  117099
99        96166        NaN   Oconnor      Oklahoma   51    1/1/2017  155673
105       29778        NaN    Dawson          Utah   63    1/1/2017  151819
...         ...        ...       ...           ...  ...         ...     ...
206038   121317        NaN    Melton  Pennsylvania   28   3/31/2020   87783
206044   200799        NaN  Copeland        Hawaii   52    4/1/2020  108488
206090   167394        NaN     Frost        Hawaii   61    4/1/2020   45275
206162   187532        NaN     Floyd    California   39    4/1/2020   56325
206171   116898        NaN   Delgado      Colorado   23    4/1/2020   59222

[11259 rows x 7 columns]

The only missing values are in the first name column. Since first names are not essential to this project, I will leave it as is. I could also consider removing the First Name column entirly from the data frame.

In [72]:
#Check for mixed_types of data

for col in cust_2.columns.tolist():
  weird = (cust_2[[col]].applymap(type) != cust_2[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cust_2[weird]) > 0:
    print (col)

first_name

In [73]:
#Change data type of First Name

cust_2['first_name'] = cust_2['first_name'].astype('str')

## 6.

In [74]:
cust_2.shape

(206209, 10)

In [14]:
ords_prods_merge.shape

(32404859, 28)

In [15]:
ords_prods_merge = ords_prods_merge.merge(cust_2, on = ['user_id'])

In [16]:
ords_prods_merge.shape

(32404859, 37)

In [17]:
ords_prods_merge.head()

,Unnamed: 0_x,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,...,frequency_flag,first_name,last_name,gender,state,age,date_joined,number_of_dependants,fam_status,income
0,0,2539329,1,prior,1,2,8,NaN,196,1,...,Frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,1,2398795,1,prior,2,3,7,15.0,196,1,...,Frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,2,473747,1,prior,3,3,12,21.0,196,1,...,Frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,3,2254736,1,prior,4,4,7,29.0,196,1,...,Frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,4,431534,1,prior,5,4,15,28.0,196,1,...,Frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

# Exports

In [19]:
ords_prods_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged_2.pkl'))